[{"id":"26933","title":"ACCOUNTING","de_requirements":"<p>Nil<\/p>","utme_requirements":"<p>Five credit passes at not more than two sittings in the Senior School Certificate Examination (SSCE) or its equivalent-- West African Senior School Certificate Examination (WASSCE), National Examination Council (NECO), National Technical Certificate (NTC) or General Certificate of Education (GCE O\/L) in relevant subjects. The relevant subjects are English Language, Mathematics, Economics and any other two subjects from the following: Chemistry, Physics, Further Mathematics, Statistics, Agricultural Science,&nbsp; Biology, History and Geography.&nbsp;<\/p>","subjects":"<p>English Language, Mathematics, Economics and any other subject.&nbsp;<\/p>","institutions_list":"SPORTS-UNI"},{"id":"26940","title":"BIOCHEMISTRY","de_requirements":"<p>Nil<\/p>","utme_requirements":"<p>Five credit passes at not more than two sittings in the Senior School Certificate Examination (SSCE) or its equivalent-- West African Senior School Certificate Examination (WASSCE), National Examination Council (NECO) or General Certificate of Education (GCE) in relevant subjects. The relevant subjects are English Language, Mathematics, Biology and any other two subjects from the following: Chemistry, Physics, Further Mathematics, Statistics, Agricultural Science, Geography and Economics.&nbsp;<\/p>","subjects":"<p>English Language, Mathematics, Biology and any other subject.&nbsp;<\/p>","institutions_list":"SPORTS-UNI"},{"id":"26934","title":"BUSINESS ADMINISTRATION","de_requirements":"<p>Nil<\/p>","utme_requirements":"<p>Five credit passes at not more than two sittings in the Senior School Certificate Examination (SSCE) or its equivalent-- West African Senior School Certificate Examination (WASSCE), National Examination Council (NECO), National Technical Certificate (NTC) or General Certificate of Education (GCE O\/L) in relevant subjects. The relevant subjects are English Language, Mathematics, Economics\/Commerce, and any other two subjects from the following: Chemistry, Physics, Further&nbsp; Mathematics, Statistics, Agricultural Science, Biology, History and Geography.&nbsp;<\/p>","subjects":"<p>English Language, Mathematics, Economics\/Commerce and any other subject.&nbsp;<\/p>","institutions_list":"SPORTS-UNI"},{"id":"26941","title":"COMPUTER SCIENCE","de_requirements":"<p>Nil<\/p>","utme_requirements":"<p>Five credit passes at not more than two sittings in the Senior School Certificate Examination (SSCE) or its equivalent-- West African Senior School Certificate Examination (WASSCE), National Examination Council (NECO), National Technical Certificate (NTC) in relevant subjects. The relevant subjects are English Language, Mathematics, Physics and any other two subjects from the following: Chemistry, Further Mathematics, Statistics, Agricultural Science, Biology, Geography and Economics.&nbsp;<\/p>","subjects":"<p>English Language, Mathematics, Physics and any other subject.&nbsp;<\/p>","institutions_list":"SPORTS-UNI"},{"id":"26942","title":"CYBER SECURITY","de_requirements":"<p>Nil<\/p>","utme_requirements":"<p>Five credit passes at not more than two sittings in the Senior School Certificate Examination (SSCE) or its equivalent-- West African Senior School Certificate Examination (WASSCE), National Examination Council (NECO), National Technical Certificate (NTC) or General Certificate of Education (GCE) in relevant subjects.&nbsp; The relevant subjects are English Language, Mathematics, Physics and any other two subjects from the following: Chemistry, Technical Drawing, Metal Works, Further Mathematics, Statistics, Agricultural Science, Biology, Geography, History and Economics.&nbsp;<\/p>","subjects":"<p>English Language, Mathematics, Physics and any other subject.&nbsp;<\/p>","institutions_list":"SPORTS-UNI"},{"id":"26936","title":"ECONOMICS","de_requirements":"<p>Nil<\/p>","utme_requirements":"<p>Five credit passes at not more than two sittings in the Senior School Certificate Examination (SSCE) or its equivalent-- West African Senior School Certificate Examination (WASSCE), National Examination Council (NECO) or General Certificate of Education (GCE O\/L) in relevant subjects. The relevant subjects are English Language, Mathematics, Economics and any other two subjects from the following: Geography, History\/Government, Biology, Agricultural Science, Statistics, Chemistry, Physics, Further Mathematics and Fine Art.&nbsp;<\/p>","subjects":"<p>English Language, Mathematics, Economics and any other subject.&nbsp;<\/p>","institutions_list":"SPORTS-UNI"},{"id":"26935","title":"ENTREPRENEURSHIP","de_requirements":"<p>Nil<\/p>","utme_requirements":"<p>Five credit passes at not more than two sittings in the Senior School Certificate Examination (SSCE) or its equivalent-- West African Senior School Certificate Examination (WASSCE), National Examination Council (NECO) or General Certificate of Education (GCE O\/L) in relevant subjects. The relevant subjects are English Language, Mathematics, Economics and any other two other subjects from the following: Chemistry, Physics, Further Mathematics, Statistics, Agricultural Science, Biology, Geography, History and Fine Art.&nbsp;<\/p>","subjects":"<p>English Language, Mathematics, Economics and any other subject.&nbsp;<\/p>","institutions_list":"SPORTS-UNI"},{"id":"26937","title":"INTERNATIONAL RELATIONS","de_requirements":"<p>Nil<\/p>","utme_requirements":"<p>Five credit passes at not more than two sittings in the Senior School Certificate Examination (SSCE) or its equivalent-- West African Senior School Certificate Examination (WASSCE), National Examination Council (NECO) or General Certificate of Education (GCE O\/L) in relevant subjects. The relevant subjects are English Language, Mathematics, History\/Government and any other two subjects from the following: Literature in English, Economics, Geography, Biology, Chemistry, Physics, Agricultural Science and Fine Art.&nbsp;<\/p>","subjects":"<p>English Language, History\/Government, Literature in English and any other subject.&nbsp;<\/p>","institutions_list":"SPORTS-UNI"},{"id":"26939","title":"MICROBIOLOGY","de_requirements":"<p>Nil<\/p>","utme_requirements":"<p>Five credit passes at not more than two sittings in the Senior School Certificate Examination (SSCE) or its equivalent-- West African Senior School Certificate Examination (WASSCE), National Examination Council (NECO) or General Certificate of Education (GCE O\/L) in relevant subjects. The relevant subjects are English Language, Mathematics, Biology and any other two subjects from the following: Chemistry, Physics, Further Mathematics, Statistics, Agricultural Science, Geography and Economics.&nbsp;<\/p>","subjects":"<p>English Language, Mathematics, Biology and any other subject.&nbsp;<\/p>","institutions_list":"SPORTS-UNI"},{"id":"26930","title":"NURSING","de_requirements":"<p>Nil<\/p>","utme_requirements":"<p>Five credit passes at not more than two sittings in the Senior School Certificate Examination (SSCE) or its equivalent-- West African Senior School Certificate Examination (WASSCE), National Examination Council (NECO) or General Certificate of Education (GCE O\/L) in relevant subjects. The relevant subjects are English Language,Mathematics, Biology\/Health Science and any other two subjects from the following: Chemistry, Further Mathematics, Statistics, Agricultural Science, Geography and Economics.&nbsp;<\/p>","subjects":"<p>English Language, Mathematics, Biology\/Health Science and any other subject.&nbsp;<\/p>","institutions_list":"SPORTS-UNI"},{"id":"26944","title":"PHYSICAL & HEALTH EDUCATION","de_requirements":"<p>Nil<\/p>","utme_requirements":"<p>Five credit passes at not more than two sittings in the Senior School Certificate Examination (SSCE) or its equivalent-- West African Senior School Certificate Examination (WASSCE), National Examination Council (NECO),National Technical Certificate (NTC) or General Certificate of Education (GCE) in relevant subjects.&nbsp; The relevant subjects are English Language, Mathematics, Biology\/Health Science and any two subjects from the following: Chemistry, Technical Drawing, Further Mathematics, Statistics, Agricultural Science, Physics, Geography, Economics, Literature, History and Fine Art.&nbsp;<\/p>","subjects":"<p>English Language, Mathematics, Biology\/Health Science and any other subject.&nbsp;<\/p>","institutions_list":"SPORTS-UNI"},{"id":"26943","title":"PHYSICS WITH ELECTRONICS","de_requirements":"<p>Nil<\/p>","utme_requirements":"<p>Five credit passes at not more than two sittings in the Senior School Certificate Examination (SSCE) or its equivalent-- West African Senior School Certificate Examination (WASSCE), National Examination Council (NECO),National Technical Certificate (NTC) in relevant subjects. The relevant subjects are English Language, Mathematics, Physics and any other two subjects from the following: Chemistry, Technical Drawing, Basic Electricity, Further Mathematics, Statistics, Agricultural Science, Biology, Geography, Economics and Fine Art.&nbsp;<\/p>","subjects":"<p>English Language, Mathematics, Physics and any other subject.&nbsp;<\/p>","institutions_list":"SPORTS-UNI"},{"id":"26931","title":"PHYSIOTHERAPY","de_requirements":"<p>Nil.<\/p>","utme_requirements":"<p>Five credit passes at not more than two sittings in the Senior School Certificate Examination (SSCE) or its equivalent-- West African Senior School Certificate Examination (WASSCE), National Examination Council (NECO) or General Certificate of Education (GCE O\/L) in relevant subjects. The relevant subjects are English Language, Mathematics, Biology and any other two subjects from the following: Chemistry, Physics, Further Mathematics, Statistics, Agricultural Science, Geography and Economics.&nbsp;<\/p>","subjects":"<p>English Language, Mathematics, Biology\/Health Science and any other subject.&nbsp;<\/p>","institutions_list":"SPORTS-UNI"},{"id":"26938","title":"PUBLIC ADMINISTRATION","de_requirements":"<p>Nil<\/p>","utme_requirements":"<p>Five credit passes at not more than two sittings in the Senior School Certificate Examination (SSCE) or its equivalent-- West African Senior School Certificate Examination (SSCE), National Examination Council (NECO) or General Certificate of Education (GCE O\/L) in relevant subjects.&nbsp; The relevant subjects are English Language, Mathematics, History\/Government and any other two subjects from the following: Literature in English, Economics, Geography, Biology, Agricultural Science, Statistics, Chemistry, Further Mathematics and Fine Art.&nbsp;<\/p>","subjects":"<p>English Language, History\/Government, Literature in English&nbsp; and any other subject.&nbsp;<\/p>","institutions_list":"SPORTS-UNI"},{"id":"26932","title":"PUBLIC HEALTH","de_requirements":"<p>Nil<\/p>","utme_requirements":"<p>Five credit passes at not more than two sittings in the Senior School Certificate Examination (SSCE) or its equivalent-- West African Senior School Certificate Examination (WASSCE),National Examination Council (NECO)or General Certificate of Education (GCE O\/L) in relevant subjects. The relevant subjects are English Language, Mathematics, Biology and any other two subjects from the following: Chemistry, Further Mathematics, Statistics, Agricultural Science, Geography and Economics.&nbsp;<\/p>","subjects":"<p>English Language, Mathematics, Biology and any other subject.&nbsp;<\/p>","institutions_list":"SPORTS-UNI"},{"id":"26945","title":"SPORTS ADMINISTRATION & MANAGEMENT","de_requirements":"<br>","utme_requirements":"<p>Five credit passes at not more than two sittings in the Senior School Certificate Examination(SSCE), National Examination Council (NECO), National Technical Certificate (NTC)or General Certificate of Education (GCE O\/L) in relevant subjects.&nbsp; The relevant subjects are English Language, Mathematics, Economics\/Commerce and any other two subjects from the following: Chemistry, Physics, Further Mathematics, Statistics, Agricultural Science, Biology, Geography and Fine Art.&nbsp;<\/p>","subjects":"<p>English Language, Mathematics, Economics\/ Commerce and any other subject.&nbsp;<\/p>","institutions_list":"SPORTS-UNI"},{"id":"26946","title":"SPORTS SCIENCE & TECHNOLOGY","de_requirements":"<p>Nil&nbsp;<\/p>","utme_requirements":"<p>Five credit passes at not more than two sittings in the Senior School Certificate Examination (SSCE) or its equivalent-- West African Senior School Certificate Examination (WASSCE), National Examination Council (NECO),National Technical Certificate(NTC)or General Certificate of Education (GCE O\/L) in relevant subjects. The relevant subjects are English Language, Mathematics, Physics and any other two subjects from the following: Chemistry, Technical Drawing, Metal Works, Further Mathematics, Statistics, Agricultural Science, Biology, Geography and Fine Art.&nbsp;<\/p>","subjects":"<p>English Language, Mathematics, Physics and any other subject.&nbsp;<\/p>","institutions_list":"SPORTS-UNI"}]