[{"id":"3956","title":"BUILDING TECHNOLOGY","de_requirements":"<p><span>Two (2) 'A' Level passes in Mathematics, Physics or Chemistry<\/span><\/p>","utme_requirements":"<p><span>Five (5) SSC credit passes to include Mathematics, Physics,\r\nChemistry, English Language and any other Science subject.<\/span><\/p>","subjects":"Mathematics, Physics and Chemistry","institutions_list":"BIDA-DEG"},{"id":"3954","title":"ELECTRICAL\/ELECTRONICS ENGINEERING","de_requirements":"'A' Level passes in Mathematics, Physics and Chemistry.","utme_requirements":"Five (5) SSC credit passes in Mathematics, English Language, Physics, Chemistry and any one of Geography, Economics, Arts and Technical drawing. For holders of NTC,  the other relevant subjects could be Intro. to Building Construction, Bricklaying, Concreting, Walls, Floors and Ceiling Finishing, Building\/Engineering Drawing, Joinery, Carpentry, Gas, Steam Work and Bronze Welding, Cold  \/   Hot Water Supply, Sanitation and Drainage.\r\n\r\n","subjects":"Mathematics, Physics and Chemistry","institutions_list":"BIDA-DEG"},{"id":"3955","title":"QUANTITY SURVEYING","de_requirements":"<p><span>(i)<span>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;\r\n<\/span><\/span><span>Two (2) 'A' Level\r\npasses chosen from Mathematics or Physics and Chemistry, Geography or Fine\r\nArts.<\/span><\/p><p>\r\n\r\n<span>ND\/HND\r\nupper credits in relevant field.<\/span><br><\/p>","utme_requirements":"<table>\r\n <tbody><tr>\r\n  <td>\r\n  <p><span>Five (5) SSC credit passes in English\r\n  Language, Mathematics, Physics, Chemistry and any of Fine Art, Geography or\r\n  Wood Work, Biology, Economics, Technical Drawing, Further. Mathematics.,\r\n  Introduction to Building Construction, Bricklaying\/Block laying, Concreting,\r\n  Wall, Floors and Ceiling Finishing, Joinery, Carpentary, Decorative Painting,\r\n  Lining, Sign and Design, Wall Hanging, Colour Mixing\/Matching and Glazing,\r\n  Ceramics, Graphics Design, Graphic Printing, Basic Electricity.<\/span><\/p>\r\n  <p><span>&nbsp;<\/span><\/p>\r\n  <\/td>\r\n <\/tr>\r\n<\/tbody><\/table>","subjects":"Physics, Mathematics, and any of Chemistry, Geography, Art, Biology and Economics.","institutions_list":"BIDA-DEG"}]