[{"id":"14571","title":"BANKING OPERATIONS","de_requirements":"<p>N\/A<br><\/p>","utme_requirements":"<p><span>Five (5)\r\ncredit passes at SSCE or its equivalent in <\/span><span>English Language,&nbsp; Mathematics Economics&nbsp; and any other two (2) subjects from the following:<\/span><span><\/span><\/p><p><span>Commerce, Business\r\nMethods, Government, Civic Education, Biology\/Agricultural Science, Computer Studies, Home Management, History, Geography, Literature in English, Stores Management, Financial Accounts, Shorthand, Office Practice, Insurance, Tourism, Data Processing,Store Keeping, Book Keeping, Animal Husbandry, Marketing, Salesmanship, Principles of Cost Accounting. <\/span><\/p><p>\r\n\r\n\r\n\r\n<\/p><p><span><o>&nbsp;<\/o:p><\/span><\/p>","subjects":"Mathematics, Economics, Geography, Government, Commerce \/Principles of Accounts.","institutions_list":"KSITM"},{"id":"25991","title":"BUSINESS INFORMATICS","de_requirements":"<p>Not Applicable.<\/p>","utme_requirements":"<p><span>The WASC, GCE ‘O’ Level or the Senior\r\nSecondary Certificate (SSC) or their equivalent with five credits including\r\nEnglish Language, Mathematics, Economics\/Commerce (Literature in English and\r\nOral English are not acceptable in place of English Language) and any other two\r\nsubjects from Business Methods, Principles of Accounts, ICT, Geography,\r\nGovernment, Agricultural Science\/Biology, Physics Chemistry, Civic Education,\r\nInsurance, Data Processing, Book Keeping, Store Keeping, Office Practice,\r\nShorthand, Stores Management, Computer Studies, Marketing&nbsp; and Accounting.&nbsp;<\/span><\/p>","subjects":"<p><span>English Language and any other three (3) subjects\r\nfrom the following:<\/span><span>\r\nMathematics, Economics\/Commerce, Business Methods, Principles of Accounts, ICT,\r\nGeography, Government, Agricultural Science\/Biology, Physics, Chemistry, Civic\r\nEducation, Insurance, Data Processing, Book Keeping, Store Keeping, Office\r\nPractice, Shorthand, Stores Management, Computer Studies, Marketing and Accounting.<\/span><\/p>","institutions_list":"KSITM"},{"id":"25988","title":"COMPUTER HARDWARE ENGINEERING TECHNOLOGY","de_requirements":"<p>Not Applicable.<\/p>","utme_requirements":"<p><span><span>S.S.C.E\r\nor its equivalent. Credit passes in Physics, Chemistry, Mathematics, English\r\nlanguage and any other one&nbsp;<\/span><\/span><span><span>from Metal works, Technical Drawing, Basic Electronics,\r\nBiology or Agricultural Science, Geography, Further Mathematics, ICT, Computer\r\nStudies, General Woodwork, General Metalwork\/Auto-Mechanic, Basic Electricity\r\nor Applied Electricity, Technical Writing\/Building\/Engineering Drawing and\r\nStatistics.<\/span><\/span><br><\/p>","subjects":"<p><span>English Language and any other three (3) subjects from the following:<\/span><span><span> Physics, Chemistry, Mathematics, Metal works,\r\nTechnical Drawing, Basic Electronics, Biology or Agricultural Science,\r\nGeography, Further Mathematics, ICT, Computer Studies, General Woodwork,\r\nGeneral Metalwork\/Auto-Mechanic, Basic Electricity or Applied Electricity,\r\nTechnical Writing\/Building\/Engineering Drawing and Statistics.&nbsp;<\/span><\/span><br><\/p>","institutions_list":"KSITM"},{"id":"14568","title":"COMPUTER SOFTWARE ENGINEERING TECHNOLOGY","de_requirements":"<p>NOT AVAILABLE<br><\/p>","utme_requirements":"<p>Five (5) O'level Credit Passes in not more than two (2) sittings in English Language, Mathematics, Physics, Chemistry, and One(1) other subject from the following: <\/p><p>Biology, Information Communication Technology (ICT)\/Computer Studies, Basic Electricity\/Applied Electricity, General Woodwork, General Metalwork\/Auto-Mechanics, Agricultural Science\/Animal Husbandry, Geography, Technical Writing\/Building\/Engineering&nbsp; Drawing, Further Mathematics, Statistics, Food &amp; Nutrition\/Hotel &amp; Catering, Health Science. <br><\/p>","subjects":"Mathematics, Physics, Chemistry, Biology\/Agricultural Science, Geography. <br>","institutions_list":"KSITM"},{"id":"25990","title":"ISLAMIC BANKING & FINANCE","de_requirements":"<p>Not Applicable.<\/p>","utme_requirements":"<p><span>Senior Secondary School\r\nCertificate (SSCE) or its equivalent (Teachers Grade II, WASC, GCE Ordinary\r\nLevel), with five credit passes in English<\/span><br>\r\n<span>Language, Mathematics and any other three subjects from the\r\nfollowing: Economics, Business Methods, Principles of Accounts, Islamic\r\nReligious<\/span><br>\r\n<span>Studies (IRS), Literature in English, Commerce, History,\r\nStatistics, Geography, Government, Marketing and Agricultural Science\/Biology<\/span><span> Civic Education,\r\nInsurance, Data Processing, Book Keeping, Store Keeping, Office Practice,\r\nShorthand, Stores Management, Computer Studies, Marketing&nbsp; and Accounting&nbsp;<\/span><span>obtained at&nbsp;<\/span><span>not\r\nmore than two sittings; or&nbsp;<\/span><span>Candidates\r\nwith ND, HND or Bachelor’s degree who wish to re-skill or those with\r\nCertificate in related Financial and Business Studies with good&nbsp;<\/span><span>standing\r\nwork experience from the Banking and Finance Industry can be considered.<\/span><\/p>","subjects":"<p><span>English Language and any other three (3)\r\nsubjects from the following:<\/span><span> Economics, Business Methods, Principles\r\nof Accounts, IslamicReligiousStudies(IRS), Literature in English, Commerce,\r\nHistory, Statistics, Geography, Government, Marketing, Agricultural\r\nScience\/Biology,<\/span><span>\r\nCivic Education, Insurance, Data Processing, Book Keeping, Store Keeping,\r\nOffice Practice, Shorthand, Stores Management, Computer Studies, and Accounting.&nbsp;<\/span><\/p>","institutions_list":"KSITM"},{"id":"14570","title":"MULTIMEDIA TECHNOLOGY","de_requirements":"<p>NOT APPLICABLE<br><\/p>","utme_requirements":"<p><o>Five (5) O'Level Credit Passes in not more than Two(2) sittings in English Language, Mathematics and three (3) other subjects from the following: Physics, Chemistry, Biology\/Agricultural Science, Geography, Fine Art\/Technical Drawing, Economics, Civic Education, Government\/History, Literature in English, Marketing, Hausa Language and Islamic Studies.<\/o><\/p>","subjects":"Mathematics, Physics, Chemistry, Biology\/Agriculture, Geography, Economics, History\/Government.<br>","institutions_list":"KSITM"},{"id":"14569","title":"NETWORKING & SYSTEM SECURITY","de_requirements":"<p>NOT APPLICABLE <br><\/p>","utme_requirements":"<p><\/p><p>Five (5) O'level Credit Passes in not more than two (2) sittings in \r\nEnglish Language, Mathematics, Physics, Chemistry, and One(1) other \r\nsubject from the following: <\/p><p>Biology, Information Communication \r\nTechnology (ICT)\/Computer Studies, Basic Electricity\/Applied \r\nElectricity, General Woodwork, General Metalwork\/Auto-Mechanics, \r\nAgricultural Science\/Animal Husbandry, Geography, Technical \r\nWriting\/Building\/Engineering&nbsp; Drawing, Further Mathematics, Statistics, \r\nFood &amp; Nutrition\/Hotel &amp; Catering, Health Science. <br><\/p>","subjects":"Mathematics, Physics, Chemistry, Biology\/Agricultural Science and Geography. <br>","institutions_list":"KSITM"},{"id":"25989","title":"SECURITY MANAGEMENT & TECHNOLOGY","de_requirements":"<p>Not Applicable.<\/p>","utme_requirements":"<p><span><span>Candidates who have successfully\r\ncompleted Senior Secondary School Certificate or its equivalent with credit\r\npasses in five subjects to include Mathematics and English Language.<\/span><\/span><\/p>","subjects":"<p><span>English Language and any other three (3) subjects in Arts or Sciences.&nbsp;<\/span><br><\/p>","institutions_list":"KSITM"}]